# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

a = [2, -5, 8, 9, -25, 25, 4]
b = []
for i in a:
    if i == (i**0.5)** 2:
        i = i ** 0.5
        if i in b:
            pass
        else:
             b.append(int(i))
    else:
        pass
print(b)



# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

a = input("Ведите дату в формате dd.mm.yyyy: ")
b = a.split(".")
c = {"01":"Первое", "02":"Второе", "03":"Третье", "04":"Четвёртое", "05":"Пятое", "06":"Шестое", "07":"Седьмое",
     "08":"Восьмое", "09":"Девятое", "10":"Десятое", "11":"Одинадцатое", "12":"Двенадцатое", "13":"Тринадцатое",
     "14":"Четырнадцатое", "15":"Пятнадцатое", "16":"Шестнадцатое", "17":"Семнадцатое", "18":"Восемнадцатое",
     "19":"Девятнадцатое", "20":"Двадцатое", "21":"Двадцать первое", "22":"Двадцать второе", "23":"Двадцать третье",
     "24":"Двадцать четвёртое", "25":"Двадцать пятое", "26":"Двадцать шестое", "27":"Двадцать седьмое",
     "28":"Двадцать восьмое", "29":"Двадцать девятое", "30":"Тридцатое", "31":"Тридцать первое"}
d = {"01":"Января", "02":"Февраля", "03":"Марта", "04":"Апреля", "05":"Мая", "06":"Июня", "07":"Июля", "08":"Августа",
     "09":"Сентября", "10":"Октября", "11":"Ноября", "12":"Декабря"}
print("{} {} {} года".format(c[b[0]], d[b[1]], b[2]))



# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

import random

a = int(input("Введите количество элементов для списка: "))
b = []
c = 0
while c < a:
    b.append(random.randint(-100,100))
    c += 1
print(b)



# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

a = [1, 2, 4, 5, 6, 2, 5, 2]
b = []
c = []
for i in a:
    if i in b:
        pass
    else:
        b.append(i)

for d in a:
    if d in c:
        c.remove(d)
    else:
        c.append(d)
print(b)
print(c)
